{"id":"capecluborg","slug":"capecluborg","title":"Cape Club Organization Book Funding","short":"CAPE is a student-led 501(c)(3) nonprofit that creates and donates inclusive children’s books redefining representation in literature.","description":"At CAPE (Character and Pediatric Education), we believe children’s stories play a powerful role in shaping how young readers understand themselves and others. Many traditional children’s books quietly reinforce the idea that being different is something to overcome. CAPE exists to change that narrative by creating stories that affirm identity, emotional growth, and self-acceptance.This fundraising campaign supports the printing and donation of inclusive children’s books created through CAPE. Our primary goal is to fund the production of our published titles, starting with our debut book Feeble Franny, a story centered on embracing differences and redefining self-worth. Once printed, these books will be donated to elementary schools, libraries, and pediatric hospitals across our city and state, where they can offer comfort, representation, and encouragement to young readers.Beyond our core titles, this campaign also allows us to uplift the voices of other youth authors within our nonprofit. Publishing is often financially inaccessible for young writers and artists, and CAPE serves as a platform that makes it possible. With the funds raised, we will help print books created by our members, allowing their stories to reach classrooms, hospitals, libraries, and community spaces. In doing so, we amplify diverse perspectives while giving young creators real-world publishing experience and impact.We plan to begin fundraising in January 2026 and continue throughout the year. Our initial goal is to raise eight hundred dollars, which will allow us to print and donate approximately three hundred children’s books. As additional funds are raised, we will expand both the number of books printed and the number of youth authors supported through CAPE.By supporting this campaign, you are helping place inclusive stories into the hands of children who need them most while empowering the next generation of writers and artists. These books are more than stories; they are tools for empathy, healing, and change.","img":"https://fundlibraries.retool.com/api/file/5fded256-6dee-4581-90c6-993d46b880ec","raised":45,"goal":600,"category":"Public Libraries","location":"San Jose, CA","city":"San Jose","state":"AZ","organization":"Cape Club Organization","status":"Active","start_date":"","end_date":"2027-01-04","created_at":"","updated_at":"2027-01-04","updates":[]}