{"id":"fight4thefirstlapeer","slug":"fight4thefirstlapeer","title":"Fight Censorship in the Lapeer District Library!","short":"Join your community's grassroots effort to keep censorship out of the Lapeer District Library. Together we can protect intellectual freedom.","description":"Join \"Team 1923\" as we work to defend our library district against direct attacks from book challengers and those who would defund the library.\n\n\n\nYour donation will help Fight 4 the First Lapeer fund:\n\nleafleting and letter writing campaigns\n\nrallies, tabling events and student engagement opportunities\n\nadvertising\n\nlegal advice\n\nsupplies to support our efforts\n\n\n\nThe Lapeer District Library system consists of seven branches. The Marguerite deAngeli Library, generally considered the main branch,  completed in 1923,  was funded through a Carnegie Foundation grant. Our library system is overseen by a seven member board, and funded primarily through a local millage.\n\n\n\nBeginning in early 2023, a \"Requests for Reconsideration of Materials\" campaign was begun by a small group of vocal individuals  Challenged materials were books with LGBTQ+ themes and titles from the Fifty Shades adult fiction series.   Threats were made to defund the library by defeating future millages if the books weren't removed. All challenges were denied  by the library's Director and, on appeal, by the library's Board of Trustees.\n\n\n\nSince that time, individuals who previously supported these challenges have succeeded in being appointed to the LDL Board of Trustees, and are now trying to use those seats to restrict access to the same materials.  They have also stated publicly that the community may not support the next millage request if the materials are not restricted.\n\n\n\nFight 4 the First Lapeer and \"Team 1923\" will defend our library and the right to freely access information for all members of our community.\n\n\n\nWe sincerely thank you for your support, and hope you'll join Team 1923!","img":"https://everylibraryinstitute.retool.com/api/file/85a118aa-9444-469d-a60a-e0862be9e58f","raised":765,"goal":1923,"category":"Public Libraries","location":"Lapeer, MI","city":"Lapeer","state":"MI","organization":"Fight 4 the First Lapeer","status":"Active","start_date":"","end_date":"2025-09-05","created_at":"","updated_at":"2025-09-05","updates":[]}